## Terraform Deploy EKS Demo 01 - staging - Cluster eks-demo-staging-01
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/5f4993d0-81c4-4f34-b828-641adce8f744/terraform-bin show -no-color tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks_blueprints.module.aws_eks_teams[0].aws_iam_role.platform_team["eks-admins"] has changed
  ~ resource "aws_iam_role" "platform_team" {
        id                    = "eks-demo-staging-01-eks-admins-access"
        name                  = "eks-demo-staging-01-eks-admins-access"
      + tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.argocd[0].module.helm_addon.helm_release.addon[0] has changed
  ~ resource "helm_release" "addon" {
        id                         = "argo-cd"
        name                       = "argo-cd"
        # (29 unchanged attributes hidden)

      ~ postrender {
          + args = []
        }

        # (1 unchanged block hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].module.helm_addon[0].helm_release.addon[0] has changed
  ~ resource "helm_release" "addon" {
        id                         = "coredns"
      ~ metadata                   = [
          ~ {
                name        = "coredns"
              ~ values      = jsonencode(
                  ~ {
                      ~ blueprints     = {
                          ~ connection = 7360760459747224928 -> 7360760459747225000
                        }
                        # (5 unchanged elements hidden)
                    }
                )
                # (5 unchanged elements hidden)
            },
        ]
        name                       = "coredns"
        # (28 unchanged attributes hidden)

      ~ postrender {
          + args = []
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.helm_release.addon[0] has changed
  ~ resource "helm_release" "addon" {
        id                         = "aws-load-balancer-controller"
        name                       = "aws-load-balancer-controller"
        # (29 unchanged attributes hidden)

      ~ postrender {
          + args = []
        }

        # (4 unchanged blocks hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.external_dns[0].module.helm_addon.helm_release.addon[0] has changed
  ~ resource "helm_release" "addon" {
        id                         = "external-dns"
        name                       = "external-dns"
        # (29 unchanged attributes hidden)

      ~ postrender {
          + args = []
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.karpenter[0].module.helm_addon.helm_release.addon[0] has changed
  ~ resource "helm_release" "addon" {
        id                         = "karpenter"
        name                       = "karpenter"
        # (29 unchanged attributes hidden)

      ~ postrender {
          + args = []
        }

        # (2 unchanged blocks hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].module.cluster_proportional_autoscaler[0].module.helm_addon.helm_release.addon[0] has changed
  ~ resource "helm_release" "addon" {
        id                         = "cluster-proportional-autoscaler"
        name                       = "cluster-proportional-autoscaler"
        # (29 unchanged attributes hidden)

      ~ postrender {
          + args = []
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks_blueprints_kubernetes_addons.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.eks_blueprints_kubernetes_addons.data.aws_eks_cluster.eks_cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "eks_cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "eks-demo-staging-01"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.eks_blueprints_kubernetes_addons.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.eks_blueprints_kubernetes_addons.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
    }

  # module.eks_blueprints.module.aws_eks.data.tls_certificate.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5"
    }

  # module.eks_blueprints.module.aws_eks.aws_eks_cluster.this[0] will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                        = "eks-demo-staging-01"
        name                      = "eks-demo-staging-01"
        tags                      = {}
      ~ version                   = "1.23" -> "1.24"
        # (10 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks_blueprints.module.aws_eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::362500403135:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5"
        tags            = {
            "Name" = "eks-demo-staging-01-eks-irsa"
        }
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["core_addons"].data.aws_iam_policy_document.cwlogs[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "cwlogs" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["core_addons"].data.aws_iam_policy_document.fargate_assume_role_policy[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "fargate_assume_role_policy" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + sid     = "EKSFargateAssumeRole"

          + principals {
              + identifiers = [
                  + "eks-fargate-pods.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["core_addons"].aws_iam_policy.cwlogs[0] will be updated in-place
  ~ resource "aws_iam_policy" "cwlogs" {
        id          = "arn:aws:iam::362500403135:policy/eks-demo-staging-01-core-addons-cwlogs"
        name        = "eks-demo-staging-01-core-addons-cwlogs"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:DescribeLogStreams",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # module.eks_blueprints.module.aws_eks_fargate_profiles["core_addons"].aws_iam_role.fargate[0] will be updated in-place
  ~ resource "aws_iam_role" "fargate" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "eks-fargate-pods.amazonaws.com"
                        }
                      - Sid       = "EKSFargateAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-demo-staging-01-core-addons"
        name                  = "eks-demo-staging-01-core-addons"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.argocd[0].helm_release.argocd_application["workloads"] will be updated in-place
  ~ resource "helm_release" "argocd_application" {
        id                         = "workloads"
        name                       = "workloads"
        # (27 unchanged attributes hidden)

      - set {
          - name  = "source.helm.values" -> null
          - type  = "auto" -> null
          - value = <<-EOT
                "account": "362500403135"
                "clusterName": "eks-demo-staging-01"
                "region": "us-west-2"
                "repoUrl": "https://github.com/aws-samples/eks-blueprints-actions-workflow.git"
                "spec":
                  "clusterName": "eks-demo-staging-01"
                  "ingress":
                    "host": "micbegin.people.aws.dev"
                  "source":
                    "repoURL": "https://github.com/aws-samples/eks-blueprints-actions-workflow.git"
                    "targetRevision": "main"
            EOT -> null
        }
      + set {
          + name  = "source.helm.values"
          + type  = "auto"
          + value = (known after apply)
        }

        # (7 unchanged blocks hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].data.aws_eks_addon_version.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.24"
      + most_recent        = false
      + version            = (known after apply)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].data.aws_eks_cluster_auth.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "this" {
      + id    = (known after apply)
      + name  = "eks-demo-staging-01"
      + token = (sensitive value)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_kube_proxy[0].data.aws_eks_addon_version.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.24"
      + most_recent        = false
      + version            = (known after apply)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_kube_proxy[0].aws_eks_addon.kube_proxy will be updated in-place
  ~ resource "aws_eks_addon" "kube_proxy" {
      ~ addon_version     = "v1.23.13-eksbuild.2" -> "v1.24.7-eksbuild.1"
        id                = "eks-demo-staging-01:kube-proxy"
        tags              = {
            "Blueprint"  = "eks-blueprints-actions-workflow"
            "GithubRepo" = "github.com/aws-samples/eks-blueprints-actions-workflow"
        }
        # (8 unchanged attributes hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].data.aws_iam_policy_document.aws_lb will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "aws_lb" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "iam:CreateServiceLinkedRole",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "elasticloadbalancing.amazonaws.com",
                ]
              + variable = "iam:AWSServiceName"
            }
        }
      + statement {
          + actions   = [
              + "ec2:DescribeAccountAttributes",
              + "ec2:DescribeAddresses",
              + "ec2:DescribeAvailabilityZones",
              + "ec2:DescribeCoipPools",
              + "ec2:DescribeInstances",
              + "ec2:DescribeInternetGateways",
              + "ec2:DescribeNetworkInterfaces",
              + "ec2:DescribeSecurityGroups",
              + "ec2:DescribeSubnets",
              + "ec2:DescribeTags",
              + "ec2:DescribeVpcPeeringConnections",
              + "ec2:DescribeVpcs",
              + "ec2:GetCoipPoolUsage",
              + "elasticloadbalancing:DescribeListenerCertificates",
              + "elasticloadbalancing:DescribeListeners",
              + "elasticloadbalancing:DescribeLoadBalancerAttributes",
              + "elasticloadbalancing:DescribeLoadBalancers",
              + "elasticloadbalancing:DescribeRules",
              + "elasticloadbalancing:DescribeSSLPolicies",
              + "elasticloadbalancing:DescribeTags",
              + "elasticloadbalancing:DescribeTargetGroupAttributes",
              + "elasticloadbalancing:DescribeTargetGroups",
              + "elasticloadbalancing:DescribeTargetHealth",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "acm:DescribeCertificate",
              + "acm:ListCertificates",
              + "cognito-idp:DescribeUserPoolClient",
              + "iam:GetServerCertificate",
              + "iam:ListServerCertificates",
              + "shield:CreateProtection",
              + "shield:DeleteProtection",
              + "shield:DescribeProtection",
              + "shield:GetSubscriptionState",
              + "waf-regional:AssociateWebACL",
              + "waf-regional:DisassociateWebACL",
              + "waf-regional:GetWebACL",
              + "waf-regional:GetWebACLForResource",
              + "wafv2:AssociateWebACL",
              + "wafv2:DisassociateWebACL",
              + "wafv2:GetWebACL",
              + "wafv2:GetWebACLForResource",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:AuthorizeSecurityGroupIngress",
              + "ec2:RevokeSecurityGroupIngress",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateSecurityGroup",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "Null"
              + values   = [
                  + "false",
                ]
              + variable = "aws:RequestTag/elbv2.k8s.aws/cluster"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "CreateSecurityGroup",
                ]
              + variable = "ec2:CreateAction"
            }
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DeleteTags",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "Null"
              + values   = [
                  + "false",
                ]
              + variable = "aws:ResourceTag/ingress.k8s.aws/cluster"
            }
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:AddTags",
              + "elasticloadbalancing:DeleteTargetGroup",
              + "elasticloadbalancing:RemoveTags",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]

          + condition {
              + test     = "Null"
              + values   = [
                  + "false",
                ]
              + variable = "aws:ResourceTag/ingress.k8s.aws/cluster"
            }
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DeleteTags",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "Null"
              + values   = [
                  + "false",
                ]
              + variable = "aws:ResourceTag/elbv2.k8s.aws/cluster"
            }
          + condition {
              + test     = "Null"
              + values   = [
                  + "true",
                ]
              + variable = "aws:RequestTag/elbv2.k8s.aws/cluster"
            }
        }
      + statement {
          + actions   = [
              + "ec2:AuthorizeSecurityGroupIngress",
              + "ec2:DeleteSecurityGroup",
              + "ec2:RevokeSecurityGroupIngress",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "Null"
              + values   = [
                  + "false",
                ]
              + variable = "aws:ResourceTag/elbv2.k8s.aws/cluster"
            }
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:CreateLoadBalancer",
              + "elasticloadbalancing:CreateTargetGroup",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "Null"
              + values   = [
                  + "false",
                ]
              + variable = "aws:RequestTag/elbv2.k8s.aws/cluster"
            }
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:CreateListener",
              + "elasticloadbalancing:CreateRule",
              + "elasticloadbalancing:DeleteListener",
              + "elasticloadbalancing:DeleteRule",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:AddTags",
              + "elasticloadbalancing:RemoveTags",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]

          + condition {
              + test     = "Null"
              + values   = [
                  + "false",
                ]
              + variable = "aws:ResourceTag/elbv2.k8s.aws/cluster"
            }
          + condition {
              + test     = "Null"
              + values   = [
                  + "true",
                ]
              + variable = "aws:RequestTag/elbv2.k8s.aws/cluster"
            }
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:AddTags",
              + "elasticloadbalancing:RemoveTags",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:DeleteLoadBalancer",
              + "elasticloadbalancing:DeleteTargetGroup",
              + "elasticloadbalancing:ModifyLoadBalancerAttributes",
              + "elasticloadbalancing:ModifyTargetGroup",
              + "elasticloadbalancing:ModifyTargetGroupAttributes",
              + "elasticloadbalancing:SetIpAddressType",
              + "elasticloadbalancing:SetSecurityGroups",
              + "elasticloadbalancing:SetSubnets",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]

          + condition {
              + test     = "Null"
              + values   = [
                  + "false",
                ]
              + variable = "aws:ResourceTag/elbv2.k8s.aws/cluster"
            }
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:DeregisterTargets",
              + "elasticloadbalancing:RegisterTargets",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "elasticloadbalancing:AddListenerCertificates",
              + "elasticloadbalancing:ModifyListener",
              + "elasticloadbalancing:ModifyRule",
              + "elasticloadbalancing:RemoveListenerCertificates",
              + "elasticloadbalancing:SetWebAcl",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].aws_iam_policy.aws_load_balancer_controller will be updated in-place
  ~ resource "aws_iam_policy" "aws_load_balancer_controller" {
        id          = "arn:aws:iam::362500403135:policy/eks-demo-staging-01-lb-irsa"
        name        = "eks-demo-staging-01-lb-irsa"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "iam:CreateServiceLinkedRole"
                      - Condition = {
                          - StringEquals = {
                              - "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = ""
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:DescribeTargetHealth",
                          - "elasticloadbalancing:DescribeTargetGroups",
                          - "elasticloadbalancing:DescribeTargetGroupAttributes",
                          - "elasticloadbalancing:DescribeTags",
                          - "elasticloadbalancing:DescribeSSLPolicies",
                          - "elasticloadbalancing:DescribeRules",
                          - "elasticloadbalancing:DescribeLoadBalancers",
                          - "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          - "elasticloadbalancing:DescribeListeners",
                          - "elasticloadbalancing:DescribeListenerCertificates",
                          - "ec2:GetCoipPoolUsage",
                          - "ec2:DescribeVpcs",
                          - "ec2:DescribeVpcPeeringConnections",
                          - "ec2:DescribeTags",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeNetworkInterfaces",
                          - "ec2:DescribeInternetGateways",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeCoipPools",
                          - "ec2:DescribeAvailabilityZones",
                          - "ec2:DescribeAddresses",
                          - "ec2:DescribeAccountAttributes",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "wafv2:GetWebACLForResource",
                          - "wafv2:GetWebACL",
                          - "wafv2:DisassociateWebACL",
                          - "wafv2:AssociateWebACL",
                          - "waf-regional:GetWebACLForResource",
                          - "waf-regional:GetWebACL",
                          - "waf-regional:DisassociateWebACL",
                          - "waf-regional:AssociateWebACL",
                          - "shield:GetSubscriptionState",
                          - "shield:DescribeProtection",
                          - "shield:DeleteProtection",
                          - "shield:CreateProtection",
                          - "iam:ListServerCertificates",
                          - "iam:GetServerCertificate",
                          - "cognito-idp:DescribeUserPoolClient",
                          - "acm:ListCertificates",
                          - "acm:DescribeCertificate",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "ec2:RevokeSecurityGroupIngress",
                          - "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = "ec2:CreateSecurityGroup"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action    = "ec2:CreateTags"
                      - Condition = {
                          - Null         = {
                              - "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          - StringEquals = {
                              - "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:ec2:*:*:security-group/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "ec2:DeleteTags",
                          - "ec2:CreateTags",
                        ]
                      - Condition = {
                          - Null = {
                              - "aws:ResourceTag/ingress.k8s.aws/cluster" = "false"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:ec2:*:*:security-group/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "elasticloadbalancing:RemoveTags",
                          - "elasticloadbalancing:DeleteTargetGroup",
                          - "elasticloadbalancing:AddTags",
                        ]
                      - Condition = {
                          - Null = {
                              - "aws:ResourceTag/ingress.k8s.aws/cluster" = "false"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = [
                          - "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          - "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          - "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "ec2:DeleteTags",
                          - "ec2:CreateTags",
                        ]
                      - Condition = {
                          - Null = {
                              - "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              - "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:ec2:*:*:security-group/*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "ec2:RevokeSecurityGroupIngress",
                          - "ec2:DeleteSecurityGroup",
                          - "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      - Condition = {
                          - Null = {
                              - "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = ""
                    },
                  - {
                      - Action    = [
                          - "elasticloadbalancing:CreateTargetGroup",
                          - "elasticloadbalancing:CreateLoadBalancer",
                        ]
                      - Condition = {
                          - Null = {
                              - "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = ""
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:DeleteRule",
                          - "elasticloadbalancing:DeleteListener",
                          - "elasticloadbalancing:CreateRule",
                          - "elasticloadbalancing:CreateListener",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                  - {
                      - Action    = [
                          - "elasticloadbalancing:RemoveTags",
                          - "elasticloadbalancing:AddTags",
                        ]
                      - Condition = {
                          - Null = {
                              - "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              - "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = [
                          - "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          - "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          - "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                      - Sid       = ""
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:RemoveTags",
                          - "elasticloadbalancing:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          - "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          - "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          - "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                      - Sid      = ""
                    },
                  - {
                      - Action    = [
                          - "elasticloadbalancing:SetSubnets",
                          - "elasticloadbalancing:SetSecurityGroups",
                          - "elasticloadbalancing:SetIpAddressType",
                          - "elasticloadbalancing:ModifyTargetGroupAttributes",
                          - "elasticloadbalancing:ModifyTargetGroup",
                          - "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          - "elasticloadbalancing:DeleteTargetGroup",
                          - "elasticloadbalancing:DeleteLoadBalancer",
                        ]
                      - Condition = {
                          - Null = {
                              - "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = ""
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:RegisterTargets",
                          - "elasticloadbalancing:DeregisterTargets",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "elasticloadbalancing:SetWebAcl",
                          - "elasticloadbalancing:RemoveListenerCertificates",
                          - "elasticloadbalancing:ModifyRule",
                          - "elasticloadbalancing:ModifyListener",
                          - "elasticloadbalancing:AddListenerCertificates",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {
            "Blueprint"  = "eks-blueprints-actions-workflow"
            "GithubRepo" = "github.com/aws-samples/eks-blueprints-actions-workflow"
        }
        # (5 unchanged attributes hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].data.aws_eks_addon_version.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.24"
      + most_recent        = false
      + version            = (known after apply)
    }

  # module.eks_blueprints_kubernetes_addons.module.external_dns[0].data.aws_iam_policy_document.external_dns_iam_policy_document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "external_dns_iam_policy_document" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "route53:ChangeResourceRecordSets",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
      + statement {
          + actions   = [
              + "route53:ListHostedZones",
              + "route53:ListResourceRecordSets",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.external_dns[0].data.aws_route53_zone.selected will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_route53_zone" "selected" {
      + arn                        = (known after apply)
      + caller_reference           = (known after apply)
      + comment                    = (known after apply)
      + id                         = (known after apply)
      + linked_service_description = (known after apply)
      + linked_service_principal   = (known after apply)
      + name                       = "micbegin.people.aws.dev"
      + name_servers               = (known after apply)
      + primary_name_server        = (known after apply)
      + private_zone               = false
      + resource_record_set_count  = (known after apply)
      + tags                       = (known after apply)
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # module.eks_blueprints_kubernetes_addons.module.external_dns[0].aws_iam_policy.external_dns will be updated in-place
  ~ resource "aws_iam_policy" "external_dns" {
        id          = "arn:aws:iam::362500403135:policy/eks-demo-staging-01-external-dns-irsa"
        name        = "eks-demo-staging-01-external-dns-irsa"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "route53:ChangeResourceRecordSets"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:route53:::hostedzone/Z0053446TEDTI1D9V3U9"
                      - Sid      = ""
                    },
                  - {
                      - Action   = [
                          - "route53:ListResourceRecordSets",
                          - "route53:ListHostedZones",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {
            "Blueprint"  = "eks-blueprints-actions-workflow"
            "GithubRepo" = "github.com/aws-samples/eks-blueprints-actions-workflow"
        }
        # (5 unchanged attributes hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.karpenter[0].data.aws_iam_policy_document.karpenter will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "karpenter" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "ec2:CreateFleet",
              + "ec2:CreateLaunchTemplate",
              + "ec2:CreateTags",
              + "ec2:DeleteLaunchTemplate",
              + "ec2:DescribeAvailabilityZones",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstanceTypeOfferings",
              + "ec2:DescribeInstanceTypes",
              + "ec2:DescribeInstances",
              + "ec2:DescribeLaunchTemplates",
              + "ec2:DescribeSecurityGroups",
              + "ec2:DescribeSpotPriceHistory",
              + "ec2:DescribeSubnets",
              + "ec2:RunInstances",
              + "iam:PassRole",
              + "pricing:GetProducts",
              + "ssm:GetParameter",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "Karpenter"
        }
      + statement {
          + actions   = [
              + "ec2:TerminateInstances",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
          + sid       = "ConditionalEC2Termination"

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "*karpenter*",
                ]
              + variable = "ec2:ResourceTag/Name"
            }
        }
    }

  # module.eks_blueprints_kubernetes_addons.module.karpenter[0].aws_iam_policy.karpenter will be updated in-place
  ~ resource "aws_iam_policy" "karpenter" {
        id          = "arn:aws:iam::362500403135:policy/eks-demo-staging-01-karpenter"
        name        = "eks-demo-staging-01-karpenter"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ssm:GetParameter",
                          - "pricing:GetProducts",
                          - "iam:PassRole",
                          - "ec2:RunInstances",
                          - "ec2:DescribeSubnets",
                          - "ec2:DescribeSpotPriceHistory",
                          - "ec2:DescribeSecurityGroups",
                          - "ec2:DescribeLaunchTemplates",
                          - "ec2:DescribeInstances",
                          - "ec2:DescribeInstanceTypes",
                          - "ec2:DescribeInstanceTypeOfferings",
                          - "ec2:DescribeImages",
                          - "ec2:DescribeAvailabilityZones",
                          - "ec2:DeleteLaunchTemplate",
                          - "ec2:CreateTags",
                          - "ec2:CreateLaunchTemplate",
                          - "ec2:CreateFleet",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "Karpenter"
                    },
                  - {
                      - Action    = "ec2:TerminateInstances"
                      - Condition = {
                          - StringLike = {
                              - "ec2:ResourceTag/Name" = "*karpenter*"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                      - Sid       = "ConditionalEC2Termination"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].module.helm_addon[0].helm_release.addon[0] will be updated in-place
  ~ resource "helm_release" "addon" {
        id                         = "coredns"
        name                       = "coredns"
      ~ values                     = [
          - <<-EOT
                image:
                  repository: 602401143452.dkr.ecr.us-west-2.amazonaws.com/eks/coredns
                  tag: v1.8.7-eksbuild.2
                deployment:
                  name: coredns
                  annotations:
                    eks.amazonaws.com/compute-type: fargate
                service:
                  name: kube-dns
                  annotations:
                    eks.amazonaws.com/compute-type: fargate
                podAnnotations:
                  eks.amazonaws.com/compute-type: fargate
            EOT,
        ] -> (known after apply)
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.helm_release.addon[0] will be updated in-place
  ~ resource "helm_release" "addon" {
        id                         = "aws-load-balancer-controller"
        name                       = "aws-load-balancer-controller"
      ~ values                     = [
          - <<-EOT
                clusterName: eks-demo-staging-01
                region: us-west-2
                image:
                  repository: 602401143452.dkr.ecr.us-west-2.amazonaws.com/amazon/aws-load-balancer-controller
            EOT,
        ] -> (known after apply)
        # (28 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].module.irsa_addon[0].aws_iam_role.irsa[0] will be updated in-place
  ~ resource "aws_iam_role" "irsa" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5:sub" = "system:serviceaccount:kube-system:aws-node"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::362500403135:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-demo-staging-01-aws-node-irsa"
        name                  = "eks-demo-staging-01-aws-node-irsa"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_vpc_cni[0].module.irsa_addon[0].aws_iam_role_policy_attachment.irsa[0] must be replaced
-/+ resource "aws_iam_role_policy_attachment" "irsa" {
      ~ id         = "eks-demo-staging-01-aws-node-irsa-2023010916553146620000000e" -> (known after apply)
      ~ policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.external_dns[0].module.helm_addon.helm_release.addon[0] will be updated in-place
  ~ resource "helm_release" "addon" {
        id                         = "external-dns"
        name                       = "external-dns"
      ~ values                     = [
          - <<-EOT
                provider: aws
                aws:
                  region: us-west-2
            EOT,
        ] -> (known after apply)
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.module.irsa[0].aws_iam_role.irsa[0] will be updated in-place
  ~ resource "aws_iam_role" "irsa" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller-sa"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::362500403135:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-demo-staging-01-aws-load-balancer-controller-sa-irsa"
        name                  = "eks-demo-staging-01-aws-load-balancer-controller-sa-irsa"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.external_dns[0].module.helm_addon.module.irsa[0].aws_iam_role.irsa[0] will be updated in-place
  ~ resource "aws_iam_role" "irsa" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5:sub" = "system:serviceaccount:external-dns:external-dns-sa"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::362500403135:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-demo-staging-01-external-dns-sa-irsa"
        name                  = "eks-demo-staging-01-external-dns-sa-irsa"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

  # module.eks_blueprints_kubernetes_addons.module.karpenter[0].module.helm_addon.module.irsa[0].aws_iam_role.irsa[0] will be updated in-place
  ~ resource "aws_iam_role" "irsa" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringLike = {
                              - "oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5:aud" = "sts.amazonaws.com"
                              - "oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5:sub" = "system:serviceaccount:karpenter:karpenter"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::362500403135:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "eks-demo-staging-01-karpenter-irsa"
        name                  = "eks-demo-staging-01-karpenter-irsa"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 1 to add, 16 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.eks_blueprints.module.aws_eks_teams[0].aws_iam_role.platform_team["eks-admins"] has changed%0A  ~ resource "aws_iam_role" "platform_team" {%0A        id                    = "eks-demo-staging-01-eks-admins-access"%0A        name                  = "eks-demo-staging-01-eks-admins-access"%0A      + tags                  = {}%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # module.eks_blueprints_kubernetes_addons.module.argocd[0].module.helm_addon.helm_release.addon[0] has changed%0A  ~ resource "helm_release" "addon" {%0A        id                         = "argo-cd"%0A        name                       = "argo-cd"%0A        # (29 unchanged attributes hidden)%0A%0A      ~ postrender {%0A          + args = []%0A        }%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].module.helm_addon[0].helm_release.addon[0] has changed%0A  ~ resource "helm_release" "addon" {%0A        id                         = "coredns"%0A      ~ metadata                   = [%0A          ~ {%0A                name        = "coredns"%0A              ~ values      = jsonencode(%0A                  ~ {%0A                      ~ blueprints     = {%0A                          ~ connection = 7360760459747224928 -> 7360760459747225000%0A                        }%0A                        # (5 unchanged elements hidden)%0A                    }%0A                )%0A                # (5 unchanged elements hidden)%0A            },%0A        ]%0A        name                       = "coredns"%0A        # (28 unchanged attributes hidden)%0A%0A      ~ postrender {%0A          + args = []%0A        }%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.eks_blueprints_kubernetes_addons.module.aws_load_balancer_controller[0].module.helm_addon.helm_release.addon[0] has changed%0A  ~ resource "helm_release" "addon" {%0A        id                         = "aws-load-balancer-controller"%0A        name                       = "aws-load-balancer-controller"%0A        # (29 unchanged attributes hidden)%0A%0A      ~ postrender {%0A          + args = []%0A        }%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.eks_blueprints_kubernetes_addons.module.external_dns[0].module.helm_addon.helm_release.addon[0] has changed%0A  ~ resource "helm_release" "addon" {%0A        id                         = "external-dns"%0A        name                       = "external-dns"%0A        # (29 unchanged attributes hidden)%0A%0A      ~ postrender {%0A          + args = []%0A        }%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.eks_blueprints_kubernetes_addons.module.karpenter[0].module.helm_addon.helm_release.addon[0] has changed%0A  ~ resource "helm_release" "addon" {%0A        id                         = "karpenter"%0A        name                       = "karpenter"%0A        # (29 unchanged attributes hidden)%0A%0A      ~ postrender {%0A          + args = []%0A        }%0A%0A        # (2 unchanged blocks hidden)%0A    }%0A%0A  # module.eks_blueprints_kubernetes_addons.module.aws_coredns[0].module.cluster_proportional_autoscaler[0].module.helm_addon.helm_release.addon[0] has changed%0A  ~ resource "helm_release" "addon" {%0A        id                         = "cluster-proportional-autoscaler"%0A        name                       = "cluster-proportional-autoscaler"%0A        # (29 unchanged attributes hidden)%0A%0A      ~ postrender {%0A          + args = []%0A        }%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.eks_blueprints_kubernetes_addons.data.aws_caller_identity.current will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_caller_identity" "current" {%0A      + account_id = (known after apply)%0A      + arn        = (known after apply)%0A      + id         = (known after apply)%0A      + user_id    = (known after apply)%0A    }%0A%0A  # module.eks_blueprints_kubernetes_addons.data.aws_eks_cluster.eks_cluster will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_eks_cluster" "eks_cluster" {%0A      + arn                       = (known after apply)%0A      + certificate_authority     = (known after apply)%0A      + cluster_id                = (known after apply)%0A      + created_at                = (known after apply)%0A      + enabled_cluster_log_types = (known after apply)%0A      + endpoint                  = (known after apply)%0A      + id                        = (known after apply)%0A      + identity                  = (known after apply)%0A      + kubernetes_network_config = (known after apply)%0A      + name                      = "eks-demo-staging-01"%0A      + outpost_config            = (known after apply)%0A      + platform_version          = (known after apply)%0A      + role_arn                  = (known after apply)%0A      + status                    = (known after apply)%0A      + tags                      = (known after apply)%0A      + version                   = (known after apply)%0A      + vpc_config                = (known after apply)%0A    }%0A%0A  # module.eks_blueprints_kubernetes_addons.data.aws_partition.current will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_partition" "current" {%0A      + dns_suffix         = (known after apply)%0A      + id                 = (known after apply)%0A      + partition          = (known after apply)%0A      + reverse_dns_prefix = (known after apply)%0A    }%0A%0A  # module.eks_blueprints_kubernetes_addons.data.aws_region.current will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_region" "current" {%0A      + description = (known after apply)%0A      + endpoint    = (known after apply)%0A      + id          = (known after apply)%0A      + name        = (known after apply)%0A    }%0A%0A  # module.eks_blueprints.module.aws_eks.data.tls_certificate.this[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "tls_certificate" "this" {%0A      + certificates = (known after apply)%0A      + id           = (known after apply)%0A      + url          = "https://oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5"%0A    }%0A%0A  # module.eks_blueprints.module.aws_eks.aws_eks_cluster.this[0] will be updated in-place%0A  ~ resource "aws_eks_cluster" "this" {%0A        id                        = "eks-demo-staging-01"%0A        name                      = "eks-demo-staging-01"%0A        tags                      = {}%0A      ~ version                   = "1.23" -> "1.24"%0A        # (10 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.eks_blueprints.module.aws_eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place%0A  ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {%0A        id              = "arn:aws:iam::362500403135:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/B4DC05C60C77B5A383010CE5F0E366C5"%0A        tags            = {%0A            "Name" = "eks-demo-staging-01-eks-irsa"%0A        }%0A      ~ thumbprint_list = [%0A          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",%0A        ] -> (known after apply)%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.eks_blueprints.module.aws_eks_fargate_profiles["core_addons"].data.aws_iam_policy_document.cwlogs[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_iam_policy_document" "cwlogs" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions   = [%0A              + "logs:CreateLogGroup",%0A              + "logs:CreateLogStream",%0A              + "logs:DescribeLogStreams",%0A              + "logs:PutLogEvents",%0A            ]%0A          + effect    = "Allow"%0A          + resources = [%0A              + "*",%0A            ]%0A        }%0A    }%0A%0A  # module.eks_blueprints.module.aws_eks_fargate_profiles["core_addons"].data.aws_iam_policy_document.fargate_assume_role_policy[0] will be read during apply%0A  # (depends on a resource or a module with changes pending)%0A <= data "aws_iam_policy_document" "fargate_assume_role_policy" {%0A      + id   = (known after apply)%0A      + json = (known after apply)%0A%0A      + statement {%0A          + actions = [%0A              + "sts:AssumeRole",%0A            ]%0A          + sid     = "EKSFargateAssumeRole"%0A%0A          + principals {%0A              + identifiers = [%0A                  + "eks-fargate-pods.amazonaws.com",%0A                ]%0A              + type        = "Service"%0A            }%0A        }%0A    }%0A%0A  # module.eks_blueprints.module.aws_eks_fargate_profiles["core_addons"].aws_iam_policy.cwlogs[0] will be updated in-place%0A  ~ resource "aws_iam_policy" "cwlogs" {%0A        id          = "arn:aws:iam::362500403135:policy/eks-demo-staging-01-core-addons-cwlogs"%0A        name        = "eks-demo-staging-01-core-addons-cwlogs"%0A      ~ policy      = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action   = [%0A                          - "logs:PutLogEvents",%0A                          - "logs:DescribeLogStreams",%0A                          - "logs:CreateLogStream",%0A                          - "logs:CreateLogGroup",%0A                        ]%0A                      - Effect   = "Allow"%0A                      - Resource = "*"%0A                      - Sid      = ""%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A        tags        = {}%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.eks_blueprints.module.aws_eks_fargate_profiles["core_addons"].aws_iam_role.fargate[0] will be updated in-place%0A  ~ resource "aws_iam_role" "fargate" {%0A      ~ assume_role_policy    = jsonencode(%0A            {%0A              - Statement = [%0A                  - {%0A                      - Action    = "sts:AssumeRole"%0A                      - Effect    = "Allow"%0A                      - Principal = {%0A                          - Service = "eks-fargate-pods.amazonaws.com"%0A                        }%0A                      - Sid       = "EKSFargateAssumeRole"%0A                    },%0A                ]%0A              - Version   = "2012-10-17"%0A            }%0A        ) -> (known after apply)%0A        id                    = "eks-demo-staging-01-core-addons"%0A        name                  = "eks-demo-staging-01-core-addons"%0A        tags                  = {}%0A        # (9 unchanged attributes hidden)%0A    }%0A%0A  # module.eks_blueprints_kubernetes_addons.module.argocd[0].helm_release.argocd_application["workloads"] will be updated in-place%0A  ~ resource "helm_release" "argocd_application" {%0A        id                         = "workloads"%0A        name                       = "workloads"%0A        # (27 unchanged attributes hidden)%0A%0A      - set {%0A          - name  = "source.helm.va ...
```

</details>
Output is too long and was truncated. You can read full Plan in <a href="https://github.com/aws-samples/eks-blueprints-actions-workflow/actions/runs/3875978444">Actions</a>.<br /><br />

#### Update kubeconfig command: `aws eks --region us-west-2 update-kubeconfig --name eks-demo-staging-01`

*Pusher: @micbegin, Action: `pull_request`, Working Directory: `/home/runner/work/eks-blueprints-actions-workflow/eks-blueprints-actions-workflow`, Workflow: `Terraform Deploy EKS Demo 01 staging`*